#2

#ES6-ში შემოვიდა ახალი ცვლადების დეკლარაცია:

#let: გამოიყენება ცვლადების განსაზღვრისთვის, რომლის მნიშვნელობა შეიძლება შეიცვალოს, მაგრამ მას აქვს ბლოკის ს_SCOPE.
#const: გამოყენებულია მუდმივისათვის, რომლის მნიშვნელობაც ვერ შეიცვლება.

#const y = 30;
#y = 40; // შეცდომა! const მუდმივია

#let x = 10;
#x = 20; // მოქმედებს, რადგან let-ია

#3
#Scope (მხარე) JavaScript-ში აღნიშნავს იმ ტერიტორიას, სადაც ცვლადები და ფუნქციები ხელმისაწვდომია და რომელდაც კოდის ნაწილში ისინი განსაზღვრულია

#4
#let name = "Alice";
#let age = 25;
#let message = `Hello, my name is ${name} and I am ${age} years old.`;
#console.log(message);  // "Hello, my name is Alice and I am 25 years old."

#5
